app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`
---
  def index
    @posts = Post.all  # すべてのレコードを@postsに代入

INSERT INTO `posts` (`content`, `created_at`, `updated_at`) VALUES ('', '2023-07-30 01:37:56.446746', '2023-07-30 01:37:56.446746')
---
  def create
    Post.create(content: params[:content])